## Plan Result (sds_ithc_ado)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.mi_polybasestaging_owner[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.mi_polybasestaging_owner[0] will be created
  + resource "azurerm_role_assignment" "mi_polybasestaging_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0cb187b1-e17b-453c-aabb-2b3be61087df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingithc"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"sds_ithc_ado","Vars":{}} -->